1. Create 5 different python objects as following:

Python list with string values. (Store it in variable data_labels_1)

In [29]:
import pandas as pd

In [30]:
import numpy as np

In [31]:
data_labels_1 = ["Lion", "Tiger", "Elephant","Hippo"]
data_labels_1

['Lion', 'Tiger', 'Elephant', 'Hippo']

In [32]:
data_values_1 = [1,2,3,4]
data_values_1

[1, 2, 3, 4]

In [33]:
series_numpy_array_1 = np.array([1,2,3,4])
series_numpy_array_1

array([1, 2, 3, 4])

In [34]:
dict2 = {1:"Anish",2: "Ayush" ,3:"Bashanta" ,4: "Saurav" , 5: "Shishir" }
dict2

{1: 'Anish', 2: 'Ayush', 3: 'Bashanta', 4: 'Saurav', 5: 'Shishir'}

Create a new python series that stores the population of 5 various cities as data and name of the cities as indexes from data given below. Store it in variable cities_population.

indexes = ['Biratnagar', 'Kathmandu', 'Lalitpur', 'Pokhara', 'Narayangarh']

data = [200000, 1600000, 600000, 500000, 350000]

In [35]:
cities_population = pd.Series([200000, 1600000, 600000, 500000, 350000], index = ["Biratnagar", "Kathmandu", "Lalitpur", "Pokhara", "Syangja"])
cities_population

Biratnagar     200000
Kathmandu     1600000
Lalitpur       600000
Pokhara        500000
Syangja        350000
dtype: int64


Create different python series for each question below out of the data above as follows:

Using python list data_values_1. What do you observe regarding the indexes?

I observed that the indexes are auto generated and are started from 0.

In [36]:
data_values_1 = [1,2,3,4]

values_series = pd.Series(data_values_1)
values_series

0    1
1    2
2    3
3    4
dtype: int64

Using python list data_labels_1. What do you observe regarding the datatype of the series?
After using hte list data_labels_1 I observed that the datatype of the series is object. or pandas.core.series.Series

In [37]:
data_labels_1 = ["Lion", "Tiger", "Elephant","Hippo"]
labels_series = pd.Series(data_labels_1)
labels_series

0        Lion
1       Tiger
2    Elephant
3       Hippo
dtype: object

Using data_values_1 as data values and data_labels_1 as indexes

In [38]:
new_data = pd.Series([1,2,3,4], index = ["Lion", "Tiger", "Elephant","Hippo"])
new_data

Lion        1
Tiger       2
Elephant    3
Hippo       4
dtype: int64

Using numpy array series_numpy_array_1.

In [39]:

new_array_data = pd.Series(series_numpy_array_1)
new_array_data

0    1
1    2
2    3
3    4
dtype: int64

Using numpy array series_numpy_array_1. Set the indexes to data_labels_1.

In [40]:


new_array_data = pd.Series(series_numpy_array_1, index = data_labels_1)
new_array_data

Lion        1
Tiger       2
Elephant    3
Hippo       4
dtype: int64

Using python dictionary dict2. What do you observe regarding the indexes?

After using the python dictionary dict2 I observed that the keys are as indexes.

In [41]:
new_dict_data = pd.Series(dict2)
# type(new_dict_data)
new_dict_data

1       Anish
2       Ayush
3    Bashanta
4      Saurav
5     Shishir
dtype: object

Fetch the indexes of the series cities_population.

In [42]:
indexes = cities_population.index
indexes

Index(['Biratnagar', 'Kathmandu', 'Lalitpur', 'Pokhara', 'Syangja'], dtype='object')

Create a new python series that stores the population of 5 various cities as data and name of the cities as indexes from data given below. 

Store it in variable cities_population_2.

indexes = ['Bhaktapur', 'Kathmandu', 'Lalitpur', 'Pokhara', 'Butwal']

data = [150000, 1600000, 600000, 500000, 300000]

In [43]:
cities_population_2 = pd.Series([150000, 1600000, 600000, 500000, 300000],index = ['Bhaktapur', 'Kathmandu', 'Lalitpur', 'Pokhara', 'Butwal'])
cities_population_2

Bhaktapur     150000
Kathmandu    1600000
Lalitpur      600000
Pokhara       500000
Butwal        300000
dtype: int64

In [44]:

addition = cities_population + cities_population_2
addition

Bhaktapur           NaN
Biratnagar          NaN
Butwal              NaN
Kathmandu     3200000.0
Lalitpur      1200000.0
Pokhara       1000000.0
Syangja             NaN
dtype: float64

Create a pandas DataFrame out of the following data. Store it in the variable df_.

serial_no: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10] #row indexes

subjects : ['ENG', 'NEP', 'MAT', 'SCI', 'COM'] #column headers

students : ['RAM','SHYAM','GITA','HARI','SITA','SUSHILA','RAMESH','SUBODH','ANIL','RUPA']

marks :marks =[[57, 34, 93, 84, 54], 

            [48, 49, 52, 89, 64], 

            [66, 64, 75, 38, 84], 

            [55, 47, 90, 82, 37], 

            [45, 93, 70, 53, 76], 

            [45, 63, 33, 53, 72], 

            [68, 34, 42, 43, 84], 

            [62, 69, 67, 50, 94], 

            [59, 33, 51, 68, 33], 
            
            [57, 91, 60, 37, 44]]

In [45]:
students = ['RAM', 'SHYAM', 'GITA', 'HARI', 'SITA', 'SUSHILA', 'RAMESH', 'SUBODH', 'ANIL', 'RUPA']
subjects = ['ENG', 'NEP', 'MAT', 'SCI', 'COM']
marks = [
    [57, 34, 93, 84, 54],
    [48, 49, 52, 89, 64],
    [66, 64, 75, 38, 84],
    [55, 47, 90, 82, 37],
    [45, 93, 70, 53, 76],
    [45, 63, 33, 53, 72],
    [68, 34, 42, 43, 84],
    [62, 69, 67, 50, 94],
    [59, 33, 51, 68, 33],
    [57, 91, 60, 37, 44]
]
serial_no = [1,2,3,4,5,6,7,8,9,10]

df = pd.DataFrame({ "students" : students, 
                    "ENG" : [m[0] for m in marks],
                    "NEP" : [m[1] for m in marks],
                    "MAT" : [m[2] for m in marks],
                    "SCI" : [m[3] for m in marks],
                    "COM" : [m[4] for m in marks]
}, index = serial_no)


df

   students  ENG  NEP  MAT  SCI  COM
1       RAM   57   34   93   84   54
2     SHYAM   48   49   52   89   64
3      GITA   66   64   75   38   84
4      HARI   55   47   90   82   37
5      SITA   45   93   70   53   76
6   SUSHILA   45   63   33   53   72
7    RAMESH   68   34   42   43   84
8    SUBODH   62   69   67   50   94
9      ANIL   59   33   51   68   33
10     RUPA   57   91   60   37   44

In [46]:
nep_pass = df[df.NEP >= 40]
nep_pass

   students  ENG  NEP  MAT  SCI  COM
2     SHYAM   48   49   52   89   64
3      GITA   66   64   75   38   84
4      HARI   55   47   90   82   37
5      SITA   45   93   70   53   76
6   SUSHILA   45   63   33   53   72
8    SUBODH   62   69   67   50   94
10     RUPA   57   91   60   37   44

In [47]:
sci_pass = df[df['SCI'] >= 70]
sci_pass

  students  ENG  NEP  MAT  SCI  COM
1      RAM   57   34   93   84   54
2    SHYAM   48   49   52   89   64
4     HARI   55   47   90   82   37

In [56]:
df.iloc[1,1]

np.int64(48)